#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Задание повышенной сложности

if __name__ == '__main__':
    slovo = input("Введите слово: ")
    print("Разных букв: ", len(set(slovo)))
